{
  "return_dict": true,
  "output_hidden_states": false,
  "torchscript": false,
  "dtype": "bfloat16",
  "pruned_heads": {},
  "tie_word_embeddings": true,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "is_decoder": false,
  "cross_attention_hidden_size": null,
  "add_cross_attention": false,
  "tie_encoder_decoder": false,
  "architectures": [
    "SPLADEModel"
  ],
  "finetuning_task": null,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "task_specific_params": null,
  "problem_type": null,
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": 0,
  "pad_token_id": 49999,
  "eos_token_id": 1,
  "sep_token_id": 1,
  "decoder_start_token_id": null,
  "max_length": 20,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "_name_or_path": "skt/A.X-Encoder-base",
  "transformers_version": "4.57.1",
  "cls_token_id": 0,
  "gradient_checkpointing": false,
  "layer_norm_eps": 1e-05,
  "model_type": "modernbert",
  "position_embedding_type": "absolute",
  "tf_legacy_loss": false,
  "use_bfloat16": false,
  "vocab_size": 50000,
  "max_position_embeddings": 16384,
  "hidden_size": 768,
  "intermediate_size": 1152,
  "num_hidden_layers": 22,
  "num_attention_heads": 12,
  "initializer_range": 0.02,
  "initializer_cutoff_factor": 2.0,
  "norm_eps": 1e-05,
  "norm_bias": false,
  "global_rope_theta": 160000,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "hidden_activation": "gelu",
  "global_attn_every_n_layers": 3,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "embedding_dropout": 0.0,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "decoder_bias": true,
  "classifier_pooling": "mean",
  "classifier_dropout": 0.0,
  "classifier_bias": false,
  "classifier_activation": "gelu",
  "deterministic_flash_attn": false,
  "sparse_prediction": false,
  "sparse_pred_ignore_index": -100,
  "repad_logits_with_grad": false,
  "output_attentions": false,
  "auto_map": {
    "AutoModel": "modeling_splade.SPLADEModel",
    "AutoModelForMaskedLM": "modeling_splade.SPLADEModel"
  },
  "splade_config": {
    "max_length": 64,
    "pooling": "max",
    "activation": "log1p_relu"
  }
}